import { en } from "vuetify/src/locale";

export default {
  ...en,
  home: {
    name: "Галоўная",
    title: "Вярнуць дызлайкі на YouTube",
    subtitle: "Пашырэнне для браўзера і API, якія паказваюць адзнакі «Не падабаецца» на YouTube",
    ukraine: "Падтрымайце Украіну",
    sponsors: "Спонсары",
    becomeSponsor: "Станьце нашым спонсарам",
  },
  install: {
    name: "Спампаваць",
    title: "Абярыце сваю платформу",
    subtitle: "Даступна для Firefox і ўсіх браўзераў на базе Chromium",
    title2: "Іншыя платформы",
    subtitle2: "Калі ваш браўзер яшчэ не падтрымліваецца, паспрабуйце гэты карыстальніцкі скрыпт",
    title3: "Ад іншых распрацоўшчыкаў",
    subtitle3: "Ніякай адказнасці з нашага боку, выкарыстоўвайце на свой страх і рызыку",
    firefox: "Firefox",
    chrome: "Chrome",
    edge: "Edge",
    opera: "Opera",
    brave: "Brave",
    userscript: "Карыстальніцкі скрыпт",
    tampermonkey: "Tampermonkey",
    androidReVanced: "Android - ReVanced",
    androidMorphe: "Android - Morphe",
    androidTubular: "Android (Tubular — форк NewPipe)",
    iosJailbroken: "iOS (джейлбрэйк)",
    iosUYouPlus: "iOS (uYou+)",
  },
  api: {
    name: "API",
    title: "Сардэчна запрашаем у афіцыйную дакументацыю RYD!",
    subtitle: "Каб пачаць, абярыце раздзел у меню.",
    rights: {
      title: "Правы карыстання",
      subtitle: "Выкарыстанне гэтага адкрытага API трэцімі асобамі дазволена з наступнымі абмежаваннямі:",
      bullet1: "Атрыбуцыя: ",
      bullet1text:
        "Гэты праект павінен быць выразна пазначаны спасылкай на гэты рэпазіторый або спасылкай на returnyoutubedislike.com",
      bullet2: "Абмежаванне частаты: ",
      bullet2text:
        "Дзейнічаюць абмежаванні частоты для кожнага кліента: 100 у хвіліну і 10 000 у дзень. Пры перавышэнні будзе вернуты код памылкі 429, які паказвае, што ваша праграма павінна паменшыць частату запытаў",
    },
    url: {
      title: "Інфармацыя пра URL-адрас",
      subtitle: "API даступны па наступным базавым URL-адрасе: ",
    },
    endpoints: {
      title: "Даступныя канчатковыя кропкі (эндпоінты)",
      subtitle: "Спіс даступных канчатковых кропак даступны тут: ",
    },
    fetching: {
      title: "Базавае кіраўніцтва па выбарцы",
      subtitle: "Прыклад атрымання галасоў для зададзенага ідэнтыфікатара відэа на YouTube: ",
      title2: "Прыклад запыту: ",
      url: "URL-адрас запыту: ",
      method: "Метад запыту: ",
      headers: "Загалоўкі: ",
      response: "Адказ: ",
      error1: 'Няслушны ідэнтыфікатар YouTube верне код памылкі 404 "Не знойдзена"',
      error2: 'Няправільна адфарматаваны ідэнтыфікатар YouTube верне код памылкі 400 "Няслушны запыт"',
    },
  },
  help: {
    name: "Дапамога",
    title: "Дыягностыка",
    bullet1: "Пераканайцеся, што ў вас усталявана апошняя версія пашырэння (цяпер гэта ",
    bullet11: ").",
    bullet2:
      "Паспрабуйце выдаліць пашырэнне і ўсталяваць яго зноў, затым перазапусціце браўзер (усе актыўныя вокны, а не толькі адну ўкладку).",
    bullet3: "Пераканайцеся, што гэтая спасылка адкрываецца:",
    bullet31: "вы павінны ўбачыць тэкст: ",
    bullet4: "Калі нічога з вышэйпералічанага не дапамагае — паведаміце пра сваю праблему ў канале",
    bullet41: "на нашым серверы",
    bullet4a: "Паведаміце нам вашу аперацыйную сістэму, назву браўзера і версію браўзера",
    bullet4b:
      "Зрабіце здымак экрана старонкі з праблемай (напрыклад, старонкі відэа на YouTube) з адкрытай кансоллю (націсніце ",
    bullet4b1: ") — прыклад скрыншота ніжэй.",
    bullet4c: "Зрабіце здымак экрана старонкі пашырэнняў вашага браўзера з усталяваным пашырэннем.",
    bullet4c1: "Каб убачыць пашырэнні, увядзіце гэта ў адрасны радок: ",
    firefox: "для Firefox",
    chrome: "для Chrome, Edge, Brave, Opera, Vivaldi",
    detected: "Выяўлена:",
    altExampleScreenshot: "прыклад скрыншота",
  },
  faq: {
    name: "FAQ",
    title: "Частыя пытанні",
    subtitle: "Усё яшчэ ёсць пытанні? Не саромейцеся завітаць у наш Discord!",
    bullet1: "Адкуль пашырэнне атрымлівае дадзеныя?",
    bullet1text:
      "Камбінацыя архіўных дадзеных, атрыманых да закрыцця афіцыйнага API YouTube з адзнакамі «Не падабаецца», і экстрапаляцыя паводзін карыстальнікаў пашырэння.",
    bullet2: "Чаму колькасць адзнак «Не падабаецца» не абнаўляецца?",
    bullet2text:
      "На дадзены момант адзнакі «Не падабаецца» для відэа кэшуюцца і абнаўляюцца не вельмі часта. Гэта залежыць ад папулярнасці відэа, але абнаўленне можа заняць ад некалькіх гадзін да некалькіх дзён.",
    bullet3: "Як гэта працуе?",
    bullet3text:
      "Пашырэнне збірае ідэнтыфікатар відэа, якое вы глядзіце, і атрымлівае колькасць адзнак «Не падабаецца» (а таксама іншыя палі, такія як прагляды, адзнакі «Падабаецца» і г. д.), выкарыстоўваючы наш API. Затым пашырэнне адлюстроўвае колькасць адзнак «Не падабаецца» і суадносіны адзнак на старонцы. Калі вы ставіце адзнаку «Падабаецца» або «Не падабаецца», гэта фіксуецца і адпраўляецца ў базу дадзеных, каб можна было экстрапаляваць дакладную колькасць адзнак «Не падабаецца».",
    bullet4: "Ці магу я падзяліцца з вамі сваёй колькасцю адзнак «Не падабаецца»?",
    bullet4text:
      "Хутка. Мы разглядаем магчымасць выкарыстання OAuth або іншага API, даступнага толькі для чытання, з абмежаванай вобласцю доступу, каб аўтары маглі дзяліцца колькасцю адзнак «Не падабаецца» з магчымасцю яе праверкі.",
    bullet5: "Якія дадзеныя вы збіраеце і як яны апрацоўваюцца?",
    bullet5text:
      'Пашырэнне збірае толькі тыя дадзеныя, якія строга неабходныя для яго правільнай працы, такія як IP-адрас або ідэнтыфікатар відэа, якое вы глядзіце. Вашы дадзеныя ніколі не будуць прададзены трэцім асобам. Калі вы хочаце даведацца больш пра тое, як мы забяспечваем бяспеку і канфідэнцыяльнасць, азнаёмцеся з нашым <a href="https://github.com/Anarios/return-youtube-dislike/blob/main/Docs/SECURITY-FAQbe.md">FAQ па бяспецы</a>.',
    bullet6: "Як працуе API/серверная частка?",
    bullet6text:
      "Серверная частка выкарыстоўвае архіўныя дадзеныя з тых часоў, калі YouTube API яшчэ вяртаў колькасць адзнак «Не падабаецца», колькасць адзнак «Падабаецца» і «Не падабаецца» карыстальнікаў пашырэння і экстрапаляцыю. У бліжэйшай будучыні мы дазволім аўтарам кантэнту лёгка і бяспечна адпраўляць колькасць сваіх адзнак «Не падабаецца», і мы дададзім архіўныя дадзеныя ArchiveTeam (4,56 мільярда відэа) у нашу бягучую базу дадзеных. Вы таксама можаце паглядзець відэа на гэтую тэму.",
    bullet7: "Чаму лічыльнік адзнак «Не падабаецца» паказвае 'DISLIKES DISABLED'?",
    bullet7text:
      "Часам нядаўна загружанае відэа можа паказваць «DISLIKES DISABLED», нават калі аўтар не адключаў адзнакі «Не падабаецца». Гэта звязана з тым, як мы вызначаем, ці адключаныя гэтыя адзнакі. Спадзяёмся, гэта паведамленне знікне праз некалькі гадзін або калі вы паставіце адзнаку «Падабаецца» ці «Не падабаецца» і абновіце старонку.",
  },
  donate: {
    name: "Падтрымаць",
    subtitle: "Вы можаце падтрымаць ахвяраваннем нашы намаганні па забеспячэнні свабоднага Інтэрнэту!",
    patreon: "Patreon",
    crypto: "Крыптавалюта",
  },
  links: {
    name: "Спасылкі",
    title: "Спасылкі",
    subtitle: "Спасылкі на праект і яго распрацоўшчыкаў",
    contact: "Звязацца",
    translators: "Перакладчыкі",
    coolProjects: "Цікавыя праекты",
    sponsorBlockDescription: "Прапускае рэкламу, убудаваную ў відэа",
    filmotDescription: "Пошук па субтытрах YouTube",
    github: "GitHub",
    discord: "Discord",
  },
  layout: {
    notSupported: "не падтрымліваецца.",
    considerUpgrade: "Рэкамендуецца абнавіць да апошняй версіі.",
  },
};
