import { en } from "vuetify/src/locale";

export default {
  ...en,
  home: {
    name: "خانه",
    title: "Return YouTube Dislike",
    subtitle: "افزونه مرورگر و API برای نمایش dislikeها در YouTube",
    ukraine: "حمایت از اوکراین",
    sponsors: "حامیان مالی",
    becomeSponsor: "حامی ما شوید",
  },
  install: {
    name: "نصب",
    title: "پلتفرم خود را انتخاب کنید",
    subtitle: "در دسترس برای Firefox و تمام مرورگرهای Chromium",
    title2: "سایر پلتفرم‌ها",
    subtitle2: "اگر مرورگر شما هنوز پشتیبانی نمی‌شود، این Userscript را امتحان کنید",
    title3: "پیاده‌سازی‌های شخص ثالث",
    subtitle3: "هیچ مسئولیتی متوجه ما نیست، با مسئولیت خودتان استفاده کنید",
    firefox: "Firefox",
    chrome: "Chrome",
    edge: "Edge",
    opera: "Opera",
    brave: "Brave",
    userscript: "Userscript",
    tampermonkey: "Tampermonkey",
    androidReVanced: "Android - ReVanced",
    androidMorphe: "Android - Morphe",
    androidTubular: "Android (Tubular - یک فورک NewPipe)",
    iosJailbroken: "iOS (Jailbroken)",
    iosUYouPlus: "iOS (uYou+)",
  },
  api: {
    name: "API",
    title: "به مستندات رسمی RYD خوش آمدید!",
    subtitle: "برای شروع، بخشی را از منو انتخاب کنید.",
    rights: {
      title: "حقوق استفاده",
      subtitle:
        "استفاده شخص ثالث از این API عمومی با محدودیت‌های زیر مجاز است:",
      bullet1: "ارجاع: ",
      bullet1text:
        "این پروژه باید به طور واضح با پیوندی به این مخزن یا پیوندی به returnyoutubedislike.com ارجاع داده شود",
      bullet2: "محدودیت نرخ: ",
      bullet2text:
        "محدودیت‌های نرخ برای هر کلاینت ۱۰۰ در دقیقه و ۱۰,۰۰۰ در روز اعمال شده است. این یک کد وضعیت ۴۲۹ برمی‌گرداند که نشان می‌دهد برنامه شما باید درخواست‌ها را کاهش دهد",
    },
    url: {
      title: "اطلاعات URL",
      subtitle: "این API از طریق URL پایه زیر در دسترس است: ",
    },
    endpoints: {
      title: "Endpointهای موجود",
      subtitle: "فهرست endpointهای موجود در اینجا در دسترس است: ",
    },
    fetching: {
      title: "آموزش ساده دریافت اطلاعات",
      subtitle: "مثال برای دریافت آرای یک YouTube video ID مشخص: ",
      title2: "نمونه درخواست: ",
      url: "Request URL: ",
      method: "Request Method: ",
      headers: "Headers: ",
      response: "Response: ",
      error1: 'یک شناسه YouTube نامعتبر، کد وضعیت 404 "Not Found" را بازمی‌گرداند',
      error2:
        'یک شناسه YouTube با قالب نادرست، کد وضعیت 400 "Bad Request" را بازمی‌گرداند',
    },
  },
  help: {
    name: "راهنما",
    title: "عیب‌یابی",
    bullet1: "مطمئن شوید که آخرین نسخه افزونه را نصب کرده‌اید، ",
    bullet11: "در حال حاضر",
    bullet2:
      "سعی کنید افزونه را حذف و مجدداً نصب کنید، سپس مرورگر را دوباره راه‌اندازی کنید (تمام پنجره‌های فعال، نه فقط یک برگه)",
    bullet3: "مطمئن شوید این پیوند باز می‌شود: ",
    bullet31: "باید متن ساده زیر را ببینید: ",
    bullet4: "اگر هیچ‌یک از موارد بالا کمکی نکرد - مشکل خود را گزارش دهید در",
    bullet41: "در بخش",
    bullet4a: "سیستم‌عامل، نام مرورگر و نسخه مرورگر خود را به ما بگویید",
    bullet4b:
      "از صفحه دارای مشکل (مانند صفحه ویدیوی YouTube) در حالی که کنسول باز است اسکرین‌شات بگیرید (فشار دهید ",
    bullet4b1: ") - نمونه اسکرین‌شات در زیر آمده است.",
    bullet4c:
      "از صفحه افزونه‌های مرورگر خود در حالی که این افزونه نصب است، اسکرین‌شات بگیرید.",
    bullet4c1: "برای مشاهده افزونه‌ها این عبارت را در نوار آدرس وارد کنید: ",
    firefox: "برای Firefox",
    chrome: "برای Chrome، Edge، Brave، Opera و Vivaldi",
    detected: "شناسایی‌شده:",
    altExampleScreenshot: "نمونه اسکرین‌شات",
  },
  faq: {
    name: "FAQ",
    title: "پرسش‌های متداول",
    subtitle: "هنوز سوالی دارید؟ با خیال راحت به Discord ما بپیوندید!",
    bullet1: "افزونه داده‌های خود را از کجا می‌آورد؟",
    bullet1text:
      "ترکیبی از داده‌های آرشیو شده از قبل از خاموش شدن API رسمی dislike در YouTube و برآوردهای حاصل از رفتار کاربران افزونه.",
    bullet2: "چرا تعداد dislike به‌روزرسانی نمی‌شود؟",
    bullet2text:
      "در حال حاضر dislikeهای ویدیو cache می‌شوند و خیلی مکرر به‌روزرسانی نمی‌شوند. این مدت بسته به محبوبیت ویدیو متغیر است اما ممکن است از چند ساعت تا چند روز برای به‌روزرسانی طول بکشد.",
    bullet3: "این چگونه کار می‌کند؟",
    bullet3text:
      "افزونه، شناسه ویدیویی را که تماشا می‌کنید جمع‌آوری کرده و تعداد dislikeها (و فیلدهای دیگر مانند viewها، likeها و غیره) را با استفاده از API ما دریافت می‌کند. سپس افزونه تعداد dislike و نسبت را در صفحه نمایش می‌دهد. اگر ویدیویی را like یا dislike کنید، ثبت شده و به دیتابیس ارسال می‌شود تا تعداد دقیق dislike قابل برآورد باشد.",
    bullet4: "آیا می‌توانم تعداد dislikeهای خود را با شما به اشتراک بگذارم؟",
    bullet4text:
      "به‌زودی. ما در حال بررسی استفاده از OAuth یا یک API فقط خواندنی با دسترسی محدود هستیم تا تولیدکنندگان محتوا بتوانند تعداد dislikeهای خود را به صورت قابل تأیید به اشتراک بگذارند.",
    bullet5: "چه داده‌هایی را جمع‌آوری می‌کنید و چگونه با آن‌ها رفتار می‌شود؟",
    bullet5text:
      'افزونه تنها داده‌هایی را جمع‌آوری می‌کند که برای عملکرد صحیح آن کاملاً ضروری است، مانند آدرس IP یا شناسه ویدیویی که تماشا می‌کنید. هیچ‌کدام از داده‌های شما هرگز به اشخاص ثالث فروخته نخواهد شد. اگر مایلید درباره نحوه رسیدگی به امنیت و حریم خصوصی بیشتر بدانید، <a href="https://github.com/Anarios/return-youtube-dislike/blob/main/Docs/SECURITY-FAQ.md">FAQ امنیتی</a> ما را بررسی کنید.',
    bullet6: "بخش API/Backend چگونه کار می‌کند؟",
    bullet6text:
      "بخش backend از داده‌های آرشیو شده از زمانی که YouTube API هنوز تعداد dislike را برمی‌گرداند، تعداد like/dislike کاربران افزونه و برآوردها استفاده می‌کند. در آینده نزدیک به تولیدکنندگان محتوا اجازه خواهیم داد تعداد dislike خود را به آسانی و با امنیت ارسال کنند و ما داده‌های آرشیو شده ArchiveTeam (۴.۵۶ میلیارد ویدیو) را به دیتابیس فعلی خود اضافه خواهیم کرد. همچنین می‌توانید ویدیویی در این زمینه مشاهده کنید.",
    bullet7: "چرا تعداد dislike عبارت 'DISLIKES DISABLED' را نمایش می‌دهد؟",
    bullet7text:
      "گاهی اوقات ممکن است یک ویدیوی تازه آپلود شده عبارت 'DISLIKES DISABLED' را نشان دهد حتی اگر سازنده آن را غیرفعال نکرده باشد، این به نحوه تشخیص ما برای غیرفعال بودن dislikeها مربوط است، این مورد باید پس از چند ساعت یا با like یا dislike کردن ویدیو و تازه‌سازی صفحه (امیدوارانه) برطرف شود.",
  },
  donate: {
    name: "کمک مالی",
    subtitle:
      "می‌توانید با یک کمک مالی از تلاش‌های ما برای آزاد نگه‌داشتن اینترنت حمایت کنید!",
    patreon: "Patreon",
    crypto: "Crypto",
  },
  links: {
    name: "لینک‌ها",
    title: "لینک‌های پروژه",
    subtitle: "لینک‌های مربوط به پروژه و توسعه‌دهندگان آن",
    contact: "تماس با من",
    translators: "مترجمان",
    coolProjects: "پروژه‌های جالب",
    sponsorBlockDescription: "رد کردن تبلیغات گنجانده‌شده در ویدیو",
    filmotDescription: "جستجوی ویدیوهای YouTube بر اساس زیرنویس",
    github: "GitHub",
    discord: "Discord",
  },
  layout: {
    notSupported: "پشتیبانی نمی‌شود.",
    considerUpgrade: "ارتقا به جدیدترین نسخه را در نظر بگیرید.",
  },
};
